<?php

interface TimeToWordConvertingInterface {
    public function convert(int $hours, int $minutes): string; 
}

class TimeToWordConverter implements TimeToWordConvertingInterface {
    private static $nums = array(
    	array(
            1 => 'Одна минута',
            2 => 'Две минуты',
            3 => 'Три минуты',
            4 => 'Четыре минуты',
            5 => 'Пять минут',
            6 => 'Шесть минут',
            7 => 'Семь минут',
            8 => 'Восемь минут',
            9 => 'Девять минут',
            10 => 'Десять минут',
            11 => 'Одиннадцать минут',
            12 => 'Двенадцать минут',
            13 => 'Тринадцать минут',
            14 => 'Четырнадцать минут',
            15 => 'Пятнадцать минут',
            16 => 'Шестнадцать минут',
            17 => 'Семнадцать минут',
            18 => 'Восемнадцать минут',
            19 => 'Девятнадцать минут',
            20 => 'Двадцать минут',
            21 => 'Двадцать одна минута',
            22 => 'Двадцать две минуты',
            23 => 'Двадцать три минуты',
            24 => 'Двадцать четыре минуты',
            25 => 'Двадцать пять минут',
            26 => 'Двадцать шесть минут',
            27 => 'Двадцать семь минут',
            28 => 'Двадцать восемь минут',
            29 => 'Двадцать девять минут',
        ),
		array(
			1	=> 'Один',
			2	=> 'Два',
			3	=> 'Три',
			4	=> 'Четыре',
			5	=> 'Пять',
			6	=> 'Шесть',
			7	=> 'Семь',
			8	=> 'Восемь',
			9	=> 'Девять',
			10	=> 'Десять',
			11	=> 'Одиннадцать',
			12	=> 'Двенадцать',
			13	=> 'Тринадцать',
			14	=> 'Четырнадцать' ,
			15	=> 'Пятнадцать',
			16	=> 'Шестнадцать',
			17	=> 'Семнадцать',
			18	=> 'Восемнадцать',
			19	=> 'Девятнадцать',
			20	=> 'Двадцать',
			30	=> 'Тридцать',
			40	=> 'Сорок',
			50	=> 'Пятьдесят',
        ),
        array(
            1 => 'первого',
            2 => 'второго',
            3 => 'третьего',
            4 => 'четвертого',
            5 => 'пятого',
            6 => 'шестого',
            7 => 'седьмого',
            8 => 'восьмого',
            9 => 'девятого',
            10 => 'десятого',
            11 => 'одиннадцатого',
            12 => 'двенадцатого',
            13 => 'первого',
        ),
        array(
            1 => 'первого',
            2 => 'двух',
            3 => 'трех',
            4 => 'четырех',
            5 => 'пяти',
            6 => 'шести',
            7 => 'семи',
            8 => 'восьми',
            9 => 'двеяти',
            10 => 'десяти',
            11 => 'одиннадцати',
            12 => 'двенадцати',
            13 => 'тринадцати',
        )
    );

    public function convert(int $hours, int $minutes): string {
        $ans = "";
        if (!$minutes) {
            if ($hours == 1) {
                $ans .= static::$nums[1][$hours]." час";
            } elseif ($hours >= 2 and $hours < 5) {
                $ans .= static::$nums[1][$hours]." часа";
            } else {
                $ans .= static::$nums[1][$hours]." часов";
            }
        } elseif ($minutes == 15) {
            $ans .= "Четверть ".static::$nums[2][$hours + 1];
        } elseif ($minutes == 30) {
            $ans .= "Половина ".static::$nums[2][$hours + 1];
        } else {
            if ($minutes < 30) {
                $ans .= static::$nums[0][$minutes]. " после ".static::$nums[3][$hours];
            } else {
                $ans .= static::$nums[0][60 - $minutes]. " до ".static::$nums[3][$hours + 1];
			}
        }
        $ans .= ".";
        return $ans;
    }
}

$example = new TimeToWordConverter();
$str = $example->convert(7, 59);
echo "$str";